Revit 2026 API

# WorksetDefaultVisibilitySettingsGetWorksetDefaultVisibilitySettings Method

---

Get the WorksetDefaultVisibilitySettings of the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static WorksetDefaultVisibilitySettings GetWorksetDefaultVisibilitySettings(
	Document aDoc
)
```
```vb
Public Shared Function GetWorksetDefaultVisibilitySettings (
	aDoc As Document
) As WorksetDefaultVisibilitySettings
```
```cpp
public:
static WorksetDefaultVisibilitySettings^ GetWorksetDefaultVisibilitySettings(
	Document^ aDoc
)
```
```fsharp
static member GetWorksetDefaultVisibilitySettings :
        aDoc : Document -> WorksetDefaultVisibilitySettings
```

#### Parameters

aDoc Document
     The document.

#### Return Value

WorksetDefaultVisibilitySettings The WorksetDefaultVisibilitySettings of the document.

| Exception | Condition |
| --- | --- |
| ArgumentException | WorksetDefaultVisibilitySettings is not applicable to family documents. |
| ArgumentNullException | A non-optional argument was null |

WorksetDefaultVisibilitySettings is not available in family documents.

#### Reference

WorksetDefaultVisibilitySettings Class

Autodesk.Revit.DB Namespace